<?php
return [
    400 => '请求参数不正确',
    408 => '没有权限访问接口',
    500 => '接口服务器出错',
    581 => '接口请求超时',
    588 => '访问过于频繁',
    555 => '接口服务器请求错误',
    600 => '没有注册相应的服务',
    700 => '管理员已存在',

    1000 => '上传的文件太大了',
    1001 => '文件类型不正确',
    1004 => '任务ID没找到',
    1005 => '服务器忙，请稍后重试',
    1006 => 'AI创作任务不存在',
    1008 => 'AI创作任务进行中',
    1009 => 'AI创作调用API失败',
    1010 => '没有找到要操作的对象',

    1020 => '消息队列服务器无法连接',
    1021 => 'AI客户端校验失败',
    1022 => '指定的用户任务不存在',
    1023 => 'AI客户端没有启动',

    1030 => '文件没有写入权限',
    1031 => '不支持的操作类型',

    2000 => '要上传的文件不存在',
    2002 => '无法上传到云',
    2003 => '请求URL时失败',
    2004 => '从AWS云上获取文件失败',
    2005 => '在AWS云上复制对象时失败',
    2006 => '删除AWS云上的对象时失败',
    2007 => 'AWS云返回状态不正确',
    2008 => '本地数据错误',

    2020 => '翻译接口出错',
    2021 => '提示词含有敏感内容',

    2030 => '没有找到这个要处理的图片',
    2031 => 'AI服务器接口出错,没有返回可用的信息',
    2032 => '读取网络图片出错',

    2040 => '消息体格式不正确',

    3000 => '用户没有认证通过',
    3001 => "参数加解密失败",
    3002 => "用户不存在",
    3003 => "你不能修改别人的信息",
    3004 => "没有任何用户信息被修改",
    3005 => "注册账号失败",

    4000 => '消费类型错误',
    4001 => '非法的引擎代码',
    4002 => '非法的计费项',
    4003 => '没有找到这个充值单',
    4004 => '订单已被取消',
    4005 => '订单未收到支付成功通知，请继续等待',
    4006 => '接口请求错误',

    5000 => '同步用户任务至计费业务失败',
    5001 => '同步用户任务至计费业务时没有找到这个用户',
    5002 => '同步至API创建Task时失败',

    6000 => '数据库写入错误',
    6001 => '数据库读取错误',
    6010 => '手机号格式不正确',

    7000 => '没有这个资源',
    7001 => '用户不存在',

    9000 => "缺少必填字段",
    9001 => "Token不能为空",
    

    10010 => '参数校验失败',
    10011 => '读取crosme接口数据失败',
    10012 => '接口返回为空',
    10006 => '数组索引键名不存在',

    10020 => '你的账户余额不足',
    10109 => '验证码输入不正确',

    10200 => '创建支付意向出错',
    10201 => '恢复订阅失败',
];